import { FC } from 'react';

const Terms: FC = () => {
  return (
    <div className="py-4 px-8 container mx-auto min-h-screen pt-navbarHeight">
      <div className="my-14">
        <div>
          <h2 className="font-bold text-3xl mb-4">Способи Доставки та Оплати</h2>
          <section className="mb-4 w-3/4">
            <h3 className="font-bold mb-2 text-xl">Способи Доставки</h3>
            <p className="mb-2">Доставка до відділень &quot;Нової Пошти&quot; по всій Україні!</p>
            <p className="mb-2">
              Завдяки послузі доставки &quot;Нової Пошти&quot; ви можете отримати ваші товари у будь
              яких куточках України.
            </p>

            <p className="font-bold mb-2 text-xl">Вартість доставки до відділень:</p>
            <p className="mb-2">
              ( Зверніть увагу, що вартість доставки товарів може змінюватися в залежності від їх
              ваги та габаритів. )
            </p>
            <p className="mb-2">
              Всі замовлення на суму понад 1000 грн до відділення &quot;Нової Пошти&quot; -
              БЕЗКОШТОВНО!
            </p>
            <p className="">Інші доставки за стандартними тарифами &quot;Нової Пошти&quot;</p>
          </section>
          <section className="w-3/4 mb-4">
            <h3 className="font-bold mb-2 text-xl">Терміни доставки:</h3>
            <p className="mb-2">
              У середньому доставка займає 1-3 дні (За умови наявності товару). Наші менеджери
              погодять дату доставки з вами перед відправленням замовлення. Після відправлення ви
              отримаєте SMS-повідомлення з номером декларації. Точну дату доставки можна перевірити
              на сайті Нової Пошти.
            </p>
            <p className="mb-2">
              При отриманні посилки вам слід перевірити товар безпосередньо в відділенні служби
              доставки в присутності співробітника. У разі відсутності частини товару складається
              акт невідповідності. Якщо упаковка пошкоджена або на товарі є механічні пошкодження,
              вам слід відмовитися від посилки або подати скаргу службі доставки.
            </p>
          </section>
          <section className="w-3/4">
            <h3 className="font-bold mb-2 text-xl">Способи Оплати:</h3>
            <p className="mb-2">
              Оплата готівкою при отриманні товару доступна у всіх населених пунктах України.
            </p>
            <p className="mb-2">
              Оплата банківською карткою. Ви можете оплатити замовлення карткою Visa чи MasterCard.
            </p>
          </section>
        </div>
      </div>
    </div>
  );
};

export default Terms;
