import { IAccordionItem } from '@/components/common/accordion/Accordion';

export const featuresData: IAccordionItem[] = [
  {
    title: 'Налаштування',
    text: 'Ми пропонуємо можливість налаштування електричних систем під ваші потреби. Вибирайте з безлічі варіантів розеток та вимикачів для створення індивідуального дизайну.',
  },
  {
    title: 'Безпека',
    text: 'Ми дбаємо про вашу безпеку, пропонуючи продукцію з сертифікацією та високими стандартами якості.',
  },
  {
    title: 'Підтримка',
    text: 'Наша команда завжди готова допомогти вам з вибором та установкою обладнання. Ми забезпечуємо консультації та підтримку на всіх етапах.',
  },
  {
    title: 'Продуктивність',
    text: 'Наша команда завжди готова допомогти вам з вибором та установкою обладнання. Ми забезпечуємо консультації та підтримку на всіх етапах.',
  },
  {
    title: 'Продуктивність',
    text: 'Ми пропонуємо продукцію, яка відповідає всім сучасним вимогам до енергозбереження та ефективності. Забезпечте свою оселю якісними електричними рішеннями.',
  },
];
