import { FC } from 'react';
import Breadcrumb from '@/components/common/breadcrumb/Breadcrumb';

const About: FC = () => {
  return (
    <div className="py-4 px-8 container mx-auto min-h-screen pt-navbarHeight">
      <Breadcrumb />
      <div className="my-14 flex">
        <div className="w-1/2">
          <h1 className="font-bold text-3xl mb-4">Elektro Grand</h1>
          <p className="mb-2">
            Ласкаво просимо до &quot;Elektro Grand&quot; — вашого надійного партнера у світі
            освітлення та електрики! Наш інтернет-магазин пропонує широкий асортимент продукції, що
            відповідає найвищим стандартам якості. Ми прагнемо забезпечити наших клієнтів всім
            необхідним для комфортного і безпечного використання електрики в будь-якому домі чи
            офісі. Від стильних світильників до якісних кабелів і розеток — у нас ви знайдете все,
            що потрібно для реалізації ваших ідей.
          </p>
          <p className="mb-2">
            Наш асортимент включає сучасні рішення для освітлення, які поєднують естетику та
            функціональність. Ми пропонуємо продукцію від провідних виробників, що забезпечує не
            тільки енергозбереження, але й стильний дизайн для будь-якого інтер'єру.
          </p>
          <p className="mb-2">
            В &quot;Elektro Grand&quot; ми також розуміємо, як важливо мати доступ до якісних
            електричних компонентів. Тому ми пропонуємо широкий вибір кабелів, розеток, вимикачів та
            інших аксесуарів, які допоможуть вам реалізувати будь-які електричні проекти. Наша
            продукція відповідає всім стандартам безпеки та надійності, що дозволяє вам бути
            впевненими у своєму виборі.
          </p>
          <p className="mb-2">
            Ми прагнемо до високого рівня обслуговування клієнтів, тому у нас працює команда
            професіоналів, готових надати вам кваліфіковану допомогу та консультації. Завітайте на
            наш сайт, щоб дізнатися більше про акції та спеціальні пропозиції. &quot;Elektro
            Grand&quot; — це ваш надійний вибір у світі освітлення та електрики!
          </p>
        </div>
        <div className="w-1/2 h-full">
          <img className="w-full block" src={'/icons/main-logo.svg'} alt={'logo'} />
        </div>
      </div>
    </div>
  );
};

export default About;
